app/controllers/users_controller.rb

INSERT INTO "users" ("nickname", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nickname", "Oleg"], ["balance", 1000.0], ["created_at", "2025-12-06 22:49:33.639667"], ["updated_at", "2025-12-06 22:49:33.639667"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save